alambe94/STM32_H7_Playground/STM32_GUIX/guix/gx_touch_driver.c

#include   "tx_api.h"
#include   "gx_api.h"
#include   "gx_system.h"
#include   "gx_display.h"
#include   "gx_display_driver.h"
#include   "stm32h7b3i_discovery.h"
#include   "stm32h7b3i_discovery_ts.h"

#define TOUCH_STATE_TOUCHED  1
#define TOUCH_STATE_RELEASED 2
#define MIN_DRAG_DELTA       10


static int last_pos_x;
static int last_pos_y;
static int curpos_x;
static int curpos_y;
static int touch_state;

/**************************************************************************/
VOID SendPenDownEvent(VOID)
{
    GX_EVENT event;
    event.gx_event_type = GX_EVENT_PEN_DOWN;
    event.gx_event_payload.gx_event_pointdata.gx_point_x = curpos_x;
    event.gx_event_payload.gx_event_pointdata.gx_point_y = curpos_y;
    event.gx_event_sender = 0;
    event.gx_event_target = 0;
    event.gx_event_display_handle = LCD_SCREEN_HANDLE;
    last_pos_x = curpos_x;
    last_pos_y = curpos_y;
    gx_system_event_send(&event);
}

/**************************************************************************/
VOID SendPenDragEvent(VOID)
{
    GX_EVENT event;
    int x_delta = abs(curpos_x - last_pos_x);
    int y_delta = abs(curpos_y - last_pos_y);

    if (x_delta > MIN_DRAG_DELTA || y_delta > MIN_DRAG_DELTA)
    {
        event.gx_event_type = GX_EVENT_PEN_DRAG;
        event.gx_event_payload.gx_event_pointdata.gx_point_x = curpos_x;
        event.gx_event_payload.gx_event_pointdata.gx_point_y = curpos_y;
        event.gx_event_sender = 0;
        event.gx_event_target = 0;
        event.gx_event_display_handle = LCD_SCREEN_HANDLE;
        last_pos_x = curpos_x;
        last_pos_y = curpos_y;
    
        gx_system_event_fold(&event);
    }
}

/**************************************************************************/
VOID SendPenUpEvent(VOID)
{
    GX_EVENT event;
    event.gx_event_type = GX_EVENT_PEN_UP;
    event.gx_event_payload.gx_event_pointdata.gx_point_x = curpos_x;
    event.gx_event_payload.gx_event_pointdata.gx_point_y = curpos_y;
    event.gx_event_sender = 0;
    event.gx_event_target = 0;
    event.gx_event_display_handle = LCD_SCREEN_HANDLE;
    last_pos_x = curpos_x;
    last_pos_y = curpos_y;
    gx_system_event_send(&event);
}

/*
  *                     ReadBuffer [0]: The Byte count (0x0A)   
  *                     ReadBuffer [1]: X1 coordinate [15,8]  
  *                     ReadBuffer [2]: X1 coordinate [7,0]
  *                     ReadBuffer [3]: Y1 coordinate [15,8]
  *                     ReadBuffer [4]: Y1 coordinate [7,0]
  *                     ReadBuffer [5]: X2 coordinate [15,8]
  *                     ReadBuffer [6]: X2 coordinate [7,0]
  *                     ReadBuffer [7]: Y2 coordinate [15,8]
  *                     ReadBuffer [8]: Y2 coordinate [7,0]
  *                     ReadBuffer [9]: Gesture command (01: Zoom In 02: Zoom out) 
  *                     ReadBuffer [10]: unused byte
*/
VOID  touch_thread_entry(ULONG thread_input)
{
	TS_State_t TS_State;
    touch_state = TOUCH_STATE_RELEASED;

	TS_Init_t ts;
	ts.Width = TS_MAX_WIDTH;
	ts.Height = TS_MAX_HEIGHT;
	ts.Orientation = TS_SWAP_XY;
	ts.Accuracy = 8;
    BSP_TS_Init(0, &ts);
    
    while(1)
    {
        tx_thread_sleep(2);

        BSP_TS_GetState(0, &TS_State);

        if (!(TS_State.TouchDetected))
        {
            // no touch, check so see if last was touched
            if (touch_state == TOUCH_STATE_TOUCHED)
            {
                touch_state = TOUCH_STATE_RELEASED;
                SendPenUpEvent();
            }
        }
        else
        {

            if (TS_State.TouchX > TS_MAX_WIDTH ||
                TS_State.TouchX > TS_MAX_HEIGHT)
                continue;

            // screen is touched, update coords:
            curpos_x = TS_State.TouchX;
            
            curpos_y = TS_State.TouchX;

            if (touch_state == TOUCH_STATE_RELEASED)
            {
                touch_state = TOUCH_STATE_TOUCHED;
                SendPenDownEvent();
            }
            else
            {
                // test and send pen drag
                SendPenDragEvent();
            }
        }
    }
}
